Revit 2026 API

# ExporterIFCUtilsExportExtrudedSlabOpenings Method

---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void ExportExtrudedSlabOpenings(
	ExporterIFC exporterIFC,
	Element pElem,
	IFCLevelInfo levelInfo,
	IFCAnyHandle localPlacementAny,
	IList<IFCAnyHandle> elementSlabAnyArr,
	IList<IList<CurveLoop>> extrusionLoops,
	Plane plane,
	IFCProductWrapper pWrapper
)
```
```vb
Public Shared Sub ExportExtrudedSlabOpenings (
	exporterIFC As ExporterIFC,
	pElem As Element,
	levelInfo As IFCLevelInfo,
	localPlacementAny As IFCAnyHandle,
	elementSlabAnyArr As IList(Of IFCAnyHandle),
	extrusionLoops As IList(Of IList(Of CurveLoop)),
	plane As Plane,
	pWrapper As IFCProductWrapper
)
```
```cpp
public:
static void ExportExtrudedSlabOpenings(
	ExporterIFC^ exporterIFC,
	Element^ pElem,
	IFCLevelInfo^ levelInfo,
	IFCAnyHandle^ localPlacementAny,
	IList<IFCAnyHandle^>^ elementSlabAnyArr,
	IList<IList<CurveLoop^>^>^ extrusionLoops,
	Plane^ plane,
	IFCProductWrapper^ pWrapper
)
```
```fsharp
static member ExportExtrudedSlabOpenings :
        exporterIFC : ExporterIFC *
        pElem : Element *
        levelInfo : IFCLevelInfo *
        localPlacementAny : IFCAnyHandle *
        elementSlabAnyArr : IList<IFCAnyHandle> *
        extrusionLoops : IList<IList<CurveLoop>> *
        plane : Plane *
        pWrapper : IFCProductWrapper -> unit
```

#### Parameters

exporterIFC ExporterIFC

pElem Element

levelInfo IFCLevelInfo

localPlacementAny IFCAnyHandle

elementSlabAnyArr IListIFCAnyHandle

extrusionLoops IListIListCurveLoop

plane Plane

pWrapper IFCProductWrapper

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace